CFD_results/medium/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
79506
(
(-0.0148295472133984 0.0732795768994213 1.04444597021992)
(-0.0997939393082528 0.0708356669171163 1.04463596398648)
(0.0120458679806723 0.0237904002302787 1.04944582985387)
(-0.0102803071701617 -0.00956568659623374 1.08425007416127)
(0.0129015738200744 -0.0114495218252351 1.06902714078509)
(0.0260206166212657 -0.0193457459270516 1.06427719420499)
(0.0452176776968979 0.00169683141545725 1.04704644934591)
(0.0412850951423609 -0.0222916566340223 1.07522567038793)
...
)
;

boundaryField
{
    inlet
    {
        type            flowRateInletVelocity;
        volumetricFlowRate constant 3e-05;
        extrapolateProfile false;
        value           uniform (-0 -0 1.06796593842599);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           nonuniform List<vector> 
408
(
(-0.170176243915348 -0.100810436885498 -0.480519392618854)
(-0.177326753937617 -0.096225165687964 -0.464163451986904)
(-0.174984495652582 -0.0964312155050815 -0.419921556311671)
(-0.179976307276452 -0.0918727023901203 -0.431928026762347)
(-0.21711067291093 -0.141905016822819 -0.453092196370439)
(-0.21029521989266 -0.171289808716017 -0.467258999329119)
(-0.150591293036174 -0.12817581470737 -0.423205792007074)
(-0.170274278488797 -0.123645131609282 -0.412013647660697)
...
)
;
    }
    wall
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
