CFD_results/medium/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1612+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
226546
(
1.50180307956404e-07
-7.07606484581781e-10
-1.82074212644056e-08
-2.48953366460642e-08
-1.33173629859426e-07
2.68035706166168e-08
-1.20974859571233e-07
-1.04986417113913e-07
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
144
(
-7.92509544739315e-08
-6.4934877405852e-08
-6.68760678980108e-08
-3.85192223610573e-08
-2.36176776592468e-07
-2.96194255107322e-07
-6.38189153394926e-08
-7.83173362729596e-08
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
408
(
3.79362752427145e-08
3.51376959764422e-08
8.95180559909918e-08
9.72982614339999e-08
1.8139192072138e-08
1.66328909721188e-08
5.42427736511096e-08
8.34264377609251e-08
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
